Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བ་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེའི་མཆོག་ཅེས་བྱའོ། །
en: “The thus-gone Ratnacandra will be born in a place called Supreme Jewel.

source: འོད་ནི་དཔག་ཚད་དྲུག་བརྒྱའོ། །
en: His light will extend six hundred leagues.

source: ཡུམ་ནི་བཀོད་པ་ཆེན་མོ་ཞེས་བྱའོ། །
en: Great Array will be his mother.

source: སྲས་ནི་གསལ་དགའ་ཞེས་བྱའོ། །
en: Luminous Joy will be his son.

source: རིམ་གྲོ་པ་ནི་ཉེས་དམིགས་གདོང་ཞེས་བྱའོ། །
en: Flawed Face will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགའ་སྤྱོད་ཅེས་བྱའོ། །
en: Joyous Practice will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འགྲོས་བརྟན་ཞེས་བྱའོ། །
en: Stable Mode will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་ལྔ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་བཅྭ་ལྔ་བཅྭ་ལྔའོ། །
en: There will be twenty-five consecutive congregations, each of them gathering fifteen billion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ལྔ་སྟོང་ངོ་། །
en: The extent of his lifespan will be five thousand years.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་རྒྱལ་མཚན་སྐྱེ་བའི་ཡུལ་ནི་མངོན་པར་ཤེས་པ་རྣམ་པར་རོལ་པ་ཞེས་བྱའོ། །
en: “The thus-gone Siṃhadhvaja will be born in a place called Studded.

source: ཡབ་ནི་མངོན་ཤེས་བྱིན་ཞེས་བྱའོ། །
en: Superknowledge Gift will be his father.

source: ཡུམ་ནི་ཡིད་འོང་སེམས་ཞེས་བྱའོ། །
en: Delightful Mind will be his mother.

source: སྲས་ནི་ཟིལ་མི་ནོན་ཞེས་བྱའོ། །
en: Indomitable will be his son.

source: རིམ་གྲོ་པ་ནི་ཕན་པར་སེམས་ཞེས་བྱའོ། །
en: Benevolent Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཐུན་པར་སྤྱོད་ཅེས་བྱའོ། །
en: Harmonious Conduct will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཀུན་ཏུ་འགྲོ་ཞེས་བྱའོ། །
en: Ever Present will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ཉི་ཤུ་སྟེ་ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be twenty consecutive congregations, each of them gathering one trillion.

source: དེ་བཞིན་གཤེགས་པ་བསམ་གཏན་དགྱེས་སྐྱེ་བའི་ཡུལ་ནི་ཞི་བ་ཉམས་དགའ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Dhyānarata will be born in a place called Delightful Peace.

source: ཡབ་ནི་རླུང་གནས་ཞེས་བྱའོ། །
en: Place of Winds will be his father.

source: ཡུམ་ནི་མི་གནས་སེམས་ཞེས་བྱའོ། །
en: Nonabiding Mind will be his mother.

source: སྲས་ནི་རིན་ཆེན་རབ་ཞི་ཞེས་བྱའོ། །
en: Jewel of Peace will be his son.

source: རིམ་གྲོ་པ་ནི་ཆོས་དགའ་ཞེས་བྱའོ། །
en: Dharma Joy will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྣམ་པར་དག་སྤྱོད་ཅེས་བྱའོ། །
en: Pure Conduct will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསོད་ནམས་ལ་དད་པ་ཞེས་བྱའོ། །
en: Faith in Merit will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་སྟེ་ཐམས་ཅད་ལ་ཡང་ཁྲི་ཕྲག་རེ་རེའོ། །
en: There will be nine consecutive congregations, each of them gathering ten thousand.

source: དམ་པའི་ཆོས་ནི་ལོ་བདུན་ཁྲི་སུམ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for seventy-three thousand years.

source: དེ་བཞིན་གཤེགས་པ་རྫོགས་ལྡན་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་མཐའ་ཡས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Anupama will be born in a place called Infinite Array.

source: འོད་ནི་དཔག་ཚད་སུམ་སྟོང་ངོ་། །
en: His light will extend three thousand leagues.

source: ཡབ་ནི་མི་ཐུབ་པ་མེད་པ་ཞེས་བྱའོ། །
en: Unconquerable will be his father.

source: ཡུམ་ནི་བློ་མཚུངས་མ་ཞེས་བྱའོ། །
en: Equal Wisdom will be his mother.

source: སྲས་ནི་བློ་གྲོས་ཞི་བ་ཞེས་བྱའོ། །
en: Peaceful Intelligence will be his son.

source: རིམ་གྲོ་པ་ནི་སྡུག་པར་ལྟ་ཞེས་བྱའོ། །
en: Lovely to See will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྐར་མདའ་འཛིན་ཅེས་བྱའོ། །
en: Bearer of Meteors will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤེས་རབ་འདོད་ཅེས་བྱའོ། །
en: Wish for Insight will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་གཅིག་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be eleven consecutive congregations, each of them gathering one billion.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་རོལ་པ་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་དཔག་ཏུ་མེད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Vikrīḍita will be born in a place called Immeasurable Array.

source: སྲས་ནི་མིག་བརྒྱན་ཅེས་བྱའོ། །
en: Eye Adornment will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐོགས་མེད་བལྟ་ཞེས་བྱའོ། །
en: Unimpeded Seeing will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདེ་བར་འགྲོ་ཞེས་བྱའོ། །
en: Delightful Movement will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་གསུམ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་དྲུག་དང་བྱེ་བ་ཕྲག་གཉིས་གཉིས་སོ། །
en: There will be thirty-three consecutive congregations, each of them gathering six hundred twenty million.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་རིན་ཆེན་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་མཐའ་ཡས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Guṇaratna will be born in a place called Infinite Qualities.

source: ཡབ་ནི་ཡོན་ཏན་ཏོག་ཅེས་བྱའོ། །
en: Crest of Qualities will be his father.

source: ཡུམ་ནི་བསོད་ནམས་ཏོག་ཅེས་བྱའོ། །
en: Crest of Merit will be his mother.

source: སྲས་ནི་མཚན་བྱིན་ཞེས་བྱའོ། །
en: Gift of Marks will be his son.

source: རིམ་གྲོ་པ་ནི་ཤིན་ཏུ་རྣམ་པར་འབྱེད་ཅེས་བྱའོ། །
en: Great Discerner will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡང་དག་སེམས་ཞེས་བྱའོ། །
en: Authentic Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འབྱོར་པའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Wealth of Intelligence will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་གསུམ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བདུན་བདུན་ནོ། །
en: There will be thirteen consecutive congregations of hearers, each of them gathering seven hundred million.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་གྲགས་པ་སྐྱེ་བའི་ཡུལ་ནི་རྨད་དུ་བྱུང་བ་ཞེས་བྱའོ། །
en: “The thus-gone Arhadyaśas will be born in a place called Wondrous.

source: ཡབ་ནི་ཀླུས་སྦས་ཞེས་བྱའོ། །
en: Hidden by Nāgas will be his father.

source: སྲས་ནི་མངོན་པར་ཤེས་པའི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower of Superknowledge will be his son.

source: རིམ་གྲོ་པ་ནི་དོན་ལེགས་བསམས་ཞེས་བྱའོ། །
en: Well-Considered Aims will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དབྱངས་སྙན་ཅེས་བྱའོ། །
en: Beautiful Melody will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤེས་རབ་འབྱུང་གནས་ཞེས་བྱའོ། །
en: Source of Insight will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be ten consecutive congregations of hearers, each of them gathering eight hundred million.

source: དེ་བཞིན་གཤེགས་པ་པད་མའི་ངོས་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེ་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Padmapārśva will be born in a place called Jewel Array.

source: འོད་ནི་དཔག་ཚད་བརྒྱད་ཅུ་རྩ་དྲུག་གོ། །
en: His light will extend eighty-six leagues.

source: ཡབ་ནི་བསོད་ནམས་འབྱོར་ཅེས་བྱའོ། །
en: Wealth of Merit will be his father.

source: ཡུམ་ནི་སའི་དབང་ཕྱུག་མ་ཞེས་བྱའོ། །
en: Lady of the Land will be his mother.

source: སྲས་ནི་བཀྲ་ཤིས་ཞེས་བྱའོ། །
en: Auspicious will be his son.

source: རིམ་གྲོ་པ་ནི་དྲག་ཤུལ་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Fierce Splendor will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཁྲུག་པ་མེད་པར་གནས་ཞེས་བྱའོ། །
en: Undisturbed Rest will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཁྲུལ་པ་མེད་པར་སེམས་ཞེས་བྱའོ། །
en: Mind Free from Delusion will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be six consecutive congregations, each of them gathering one trillion.

source: དམ་པའི་ཆོས་ནི་ལོ་བརྒྱད་ཁྲི་སུམ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for eighty-three thousand years.

source: དེ་བཞིན་གཤེགས་པ་མཛོད་སྤུ་ལྡན་སྐྱེ་བའི་ཡུལ་ནི་ཡིད་དུ་འོང་བའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: “The thus-gone Ūrṇāvat will be born in a place called Attractive Splendor.

source: ཡབ་ནི་ཤེས་རབ་ཅན་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Banner of the Insightful will be his father.

source: སྲས་ནི་དགའ་བའི་ང་རོ་ཞེས་བྱའོ། །
en: Joyous Roar will be his son.

source: རིམ་གྲོ་པ་ནི་ཡིད་དུ་འོང་བའི་ང་རོ་ཞེས་བྱའོ། །
en: Delightful Roar will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྐྱེ་བོ་ཕལ་པོ་ཆེའི་ཏོག་ཅེས་བྱའོ། །
en: Crest of Humanity will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ངེས་པར་གནས་ཞེས་བྱའོ། །
en: Certain Rest will be foremost in terms of miraculous abilities.

source: དེ་བཞིན་གཤེགས་པ་སྤོབས་པ་གྲགས་པ་སྐྱེ་བའི་ཡུལ་ནི་ཡོངས་སུ་དག་པ་ཡིད་དུ་འོང་བ་ཞེས་བྱའོ། །
en: “The thus-gone Pratibhāna­kīrti will be born in a place called Perfectly Pure Beauty.

source: འོད་ནི་དཔག་ཚད་སུམ་ཁྲི་དྲུག་སྟོང་ངོ་། །
en: His light will extend thirty-six thousand leagues.

source: ཡབ་ནི་ཐར་པ་དགའ་ཞེས་བྱའོ། །
en: Liberation Joy will be his father.

source: ཡུམ་ནི་རིན་ཆེན་ཅན་ཞེས་བྱའོ། །
en: Jewel Possessor will be his mother.

source: སྲས་ནི་རྒྱལ་བྱིན་ཞེས་བྱའོ། །
en: Royal Gift will be his son.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་སྤོས་ཞེས་བྱའོ། །
en: Fragrance Qualities will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་གྲོས་འཁྲུལ་པ་མེད་ཅེས་བྱའོ། །
en: Intelligence Free from Confusion will be foremost in terms of insight.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་གཉིས་ཏེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་གསུམ་དང་འབུམ་ཕྲག་དྲུག་དྲུག་གོ། །
en: There will be thirty-two consecutive congregations, each of them gathering three million six hundred thousand.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་བཞིའོ། །
en: His lifespan will be one hundred forty million years.

source: དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེ་ནོར་བུ་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེའི་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Maṇivajra will be born in a place called Jewel Light.

source: ཡུམ་ནི་སོ་བཟངས་མ་ཞེས་བྱའོ། །
en: Excellent Edge will be his mother.

source: སྲས་ནི་གཟི་བརྗིད་སྦས་ཞེས་བྱའོ། །
en: Hidden Splendor will be his son.

source: རིམ་གྲོ་པ་ནི་བདུད་ཟིལ་གནོན་ཅེས་བྱའོ། །
en: Subjugator of the Māras will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟིལ་གྱིས་མི་ནོན་པ་ཞེས་བྱའོ། །
en: Indomitable will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཕ་རོལ་གྱི་ཚོགས་འཇོམས་པ་ཞེས་བྱའོ། །
en: Conquering the Enemy will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དྲུག་ཅུ་རྩ་གཅིག་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་གཉིས་གཉིས་སོ། །
en: There will be sixty-one consecutive congregations, each of them gathering nine hundred twenty million.

source: དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་སྐྱེ་བའི་ཡུལ་ནི་གསལ་བ་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Amitāyus will be born in a place called Luminous.

source: འོད་ནི་དཔག་ཚད་ཁྲི་སུམ་སྟོང་ངོ་། །
en: His light will extend thirteen thousand leagues.

source: ཡབ་ནི་བཟང་མཆོག་ཅེས་བྱའོ། །
en: Supreme Excellence will be his father.

source: ཡུམ་ནི་གཟི་བརྗིད་བཟང་མོ་ཞེས་བྱའོ། །
en: Excellent Splendor will be his mother.

source: རིམ་གྲོ་པ་ནི་དྲི་མེད་གྲགས་པ་ཞེས་བྱའོ། །
en: Stainless Fame will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བཟང་པོའི་ཏོག་ཅེས་བྱའོ། །
en: Crest of Excellence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བཀོད་པ་ཆེན་པོ་ཞེས་བྱའོ། །
en: Great Array will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་འབུམ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དཔག་ཏུ་མེད་དོ། །
en: There will be one hundred thousand consecutive congregations, each of them gathering innumerable bodhisattvas.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་དྲུག་ཁྲི་ཆིག་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for sixty-one thousand years.

source: དམ་པའི་ཆོས་ཇི་སྲིད་གནས་པ་དེ་སྲིད་དུ་འཁོར་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱང་འབྱུང་བར་འགྱུར་རོ། །
en: For as long as the sacred Dharma remains all bodhisattvas will continue to appear.

source: དེ་བཞིན་གཤེགས་པ་ནོར་བུ་བཀོད་པ་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེ་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Maṇivyūha will be born in a place called Jeweled Array.

source: ཡབ་ནི་མཆོད་པ་བཀོད་ཅེས་བྱའོ། །
en: Array of Offerings will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་བློ་གྲོས་མ་ཞེས་བྱའོ། །
en: Qualities of Intelligence will be his mother.

source: སྲས་ནི་བསོད་ནམས་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Merit Splendor will be his son.

source: རིམ་གྲོ་པ་ནི་ཆོས་ཀྱི་བཀོད་པ་ཞེས་བྱའོ། །
en: Dharma Array will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་བཀོད་པ་ཞེས་བྱའོ། །
en: Wisdom Array will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་མཐོང་ཞེས་བྱའོ། །
en: Sight of Power will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ལྔ་སྟེ། ཐམས་ཅད་ལ་ཡང་བརྒྱད་ཁྲི་བརྒྱད་ཁྲིའོ། །
en: There will be five consecutive congregations, each of them gathering eighty thousand.

source: དེ་བཞིན་གཤེགས་པ་དབང་ཆེན་སྐྱེ་བའི་ཡུལ་ནི་མདངས་འགྲོ་ཞེས་བྱའོ། །
en: “The thus-gone Mahendra will be born in a place called Bright Movement.

source: ཡབ་ནི་སྨན་པ་ཞེས་བྱའོ། །
en: Healer will be his father.

source: ཡུམ་ནི་རྩི་སྨན་ཞེས་བྱའོ། །
en: Medicine will be his mother.

source: སྲས་ནི་འདོད་འཕགས་ཞེས་བྱའོ། །
en: Superior Wish will be his son.

source: རིམ་གྲོ་པ་ནི་སྐར་མ་ཞེས་བྱའོ། །
en: Star will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ང་རོ་ཆེན་པོ་ཞེས་བྱའོ། །
en: Great Roar will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ང་རོ་ཐོབ་ཅེས་བྱའོ། །
en: Roar Attainment will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཞི་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་འབུམ་མོ། །
en: There will be forty consecutive congregations, each of them gathering one hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་འབྱུང་གནས་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Guṇākara will be born in a place called Endowed with Qualities.

source: ཡབ་ནི་གྲགས་པ་མངོན་པར་འཕགས་ཞེས་བྱའོ། །
en: Superior will be his father.

source: ཡུམ་ནི་གཟི་བརྗིད་མཆོག་ཅེས་བྱའོ། །
en: Supreme Splendor will be his mother.

source: སྲས་ནི་གཟི་བརྗིད་བཟང་པོ་ཞེས་བྱའོ། །
en: Excellent Splendor will be his son.

source: རིམ་གྲོ་པ་ནི་ལྷ་དགའ་ཞེས་བྱའོ། །
en: Divine Joy will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཀུན་ཏུ་ཤེས་ཞེས་བྱའོ། །
en: Universal Knowledge will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཚུགས་པ་མེད་པའི་འཁོར་ལོ་ཞེས་བྱའོ། །
en: Unaffected will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་གསུམ་གསུམ་མོ། །
en: There will be nine consecutive congregations, each of them gathering one hundred thirty million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ཁྲི་བདུན་སྟོང་ངོ་། །
en: The extent of his lifespan will be seventeen thousand years.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་ཁྲི་བདུན་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for seventeen thousand years.

source: དེ་བཞིན་གཤེགས་པ་ལྷུན་པོ་གྲགས་སྐྱེ་བའི་ཡུལ་ནི་ཚུལ་ཁྲིམས་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Meruyaśas will be born in a place called Endowed with Discipline.

source: ཡབ་ནི་དྲི་མེད་དགའ་ཞེས་བྱའོ། །
en: Stainless Joy will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་གཟི་བརྗིད་མ་ཞེས་བྱའོ། །
en: Qualities of Splendor will be his mother.

source: སྲས་ནི་སྒྲོན་མ་བྱིན་ཞེས་བྱའོ། །
en: Lamp Gift will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མིག་དག་ཅེས་བྱའོ། །
en: Pure Eye will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འགྲོ་བའི་འོད་ཟེར་ཞེས་བྱའོ། །
en: Light Rays for the World will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱད་དེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be eight consecutive congregations, each of them gathering one trillion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་སུམ་ཁྲི་སུམ་སྟོང་ངོ་། །
en: The extent of his lifespan will be thirty-three thousand years.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་བཅུ་པ་སྐྱེ་བའི་ཡུལ་ནི་ཚུགས་པ་མེད་པའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: “The thus-gone Daśaraśmi will be born in a place called Undefeatable Splendor.

source: ཡབ་ནི་མཐུ་རྩལ་མཛེས་པ་ཞེས་བྱའོ། །
en: Beautiful Power will be his father.

source: ཡུམ་ནི་བཟངས་སེམས་མ་ཞེས་བྱའོ། །
en: Fine Mind will be his mother.

source: སྲས་ནི་ཤིན་ཏུ་ཡིད་གཞུངས་ཞེས་བྱའོ། །
en: Highly Astute will be his son.

source: རིམ་གྲོ་པ་ནི་ཤེད་བུ་ཞེས་བྱའོ། །
en: Human will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡིད་དུ་འོང་བའི་དབྱངས་ཞེས་བྱའོ། །
en: Delightful Melody will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདེན་དགའ་ཞེས་བྱའོ། །
en: Delighting in Truth will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་དྲུག་འབུམ་དྲུག་འབུམ་མོ། །
en: There will be thirty-four consecutive congregations, each of them gathering six hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་མ་སྨད་པ་སྐྱེ་བའི་ཡུལ་ནི་མཆོད་རྟེན་ཞེས་བྱའོ། །
en: “The thus-gone Anindita will be born in a place called Stūpa.

source: འོད་ནི་དཔག་ཚད་དྲུག་སྟོང་ངོ་། །
en: His light will extend six thousand leagues.

source: ཡབ་ནི་རྡོ་རྗེས་བྱིན་ཞེས་བྱའོ། །
en: Vajra Gift will be his father.

source: ཡུམ་ནི་སྣ་མའི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Jasmine Flower will be his mother.

source: སྲས་ནི་ཡིད་དུ་འོང་བའི་ང་རོ་ཞེས་བྱའོ། །
en: Delightful Roar will be his son.

source: རིམ་གྲོ་པ་ནི་ཡེ་ཤེས་ངེས་ཞེས་བྱའོ། །
en: Certain Wisdom will be his attendant.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཕ་རོལ་མུ་སྟེགས་འཇོམས་ཞེས་བྱའོ། །
en: Crusher of Non-Buddhist Outsiders will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ལྔ་བཅུ་རྩ་གཉིས་ཏེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་དྲུག་དྲུག་གོ། །
en: There will be fifty-two consecutive congregations, each of them gathering six hundred million.

source: དེ་བཞིན་གཤེགས་པ་གླང་པོའི་འགྲོས་སྐྱེ་བའི་ཡུལ་ནི་མེ་ཏོག་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Nāgakrama will be born in a place called Flower Light.

source: ཡབ་ནི་ཆོས་ཞེས་བྱའོ། །
en: Dharma will be his father.

source: ཡུམ་ནི་ཆོས་བཟང་མ་ཞེས་བྱའོ། །
en: Excellent Dharma will be his mother.

source: སྲས་ནི་ནོར་ལྷ་ཞེས་བྱའོ། །
en: Wealth God will be his son.

source: རིམ་གྲོ་པ་ནི་མཆོག་སེམས་ཞེས་བྱའོ། །
en: Supreme Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་གནས་ཞེས་བྱའོ། །
en: Abode of Wisdom will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཟི་བརྗིད་གསལ་ཞེས་བྱའོ། །
en: Luminous Splendor will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགྲ་བཅོམ་པ་བྱེ་བ་ཕྲག་སྟོང་ངོ་། །གཉིས་པ་ལ་ནི་བྱེ་བ་ཕྲག་དགུ་བཅུའོ། །གསུམ་པ་ལ་ནི་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །
en: In the first congregation there will be ten billion worthy ones, in the second there will be nine hundred million, and in the third there will be eighty million.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་དྲུག་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for six thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཡིད་འཐད་སྐྱེ་བའི་ཡུལ་ནི་འོད་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Manoratha will be born in a place called Array of Light.

source: འོད་ནི་དཔག་ཚད་བདུན་སྟོང་ངོ་། །
en: His light will extend seven thousand leagues.

source: ཡབ་ནི་ཀུན་ཏུ་བཟང་པོ་ཞེས་བྱའོ། །
en: Universally Excellent will be his father.

source: ཡུམ་ནི་ཡིད་འོང་བྱིན་ཞེས་བྱའོ། །
en: Delightful Gift will be his mother.

source: སྲས་ནི་མདངས་སྟོབས་ཞེས་བྱའོ། །
en: Bright Strength will be his son.

source: རིམ་གྲོ་པ་ནི་མྱ་ངན་བྲལ་ཞེས་བྱའོ། །
en: Without Suffering will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྙན་པར་སྨྲ་ཞེས་བྱའོ། །
en: Delightful Speech will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་དགའ་བ་ཞེས་བྱའོ། །
en: Joy for the World will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་གསུམ་གསུམ་མོ། །
en: There will be fourteen consecutive congregations, each of them gathering three hundred million.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བ་སྐྱེ་བའི་ཡུལ་ནི་ཏོག་གི་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Ratnacandra will be born in a place called Radiant Crest.

source: འོད་ནི་དཔག་ཚད་དྲུག་ཁྲི་དྲུག་སྟོང་ངོ་། །
en: His light will extend sixty-six thousand leagues.

source: ཡབ་ནི་རིན་ཆེན་སེམས་ཞེས་བྱའོ། །
en: Jewel Mind will be his father.

source: ཡུམ་ནི་ལྷའི་འོད་ཟེར་ཞེས་བྱའོ། །
en: Divine Light will be his mother.

source: རིམ་གྲོ་པ་ནི་ཡུལ་འཁོར་ཤིང་རྟ་ཅན་ཞེས་བྱའོ། །
en: Land of Chariots will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Banner of Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྒྱུ་སྐར་ཞེས་བྱའོ། །
en: Star will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་བཞི་སྟེ། །ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་བཞི་བཞིའོ། །
en: There will be thirty-four consecutive congregations, each of them gathering one hundred forty million.

source: དེ་བཞིན་གཤེགས་པ་ཞི་བ་སྐྱེ་བའི་ཡུལ་ནི་སྐྱོན་མེད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Śānta will be born in a place called Flawless.

source: ཡབ་ནི་ཞི་བའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Intelligence of Peace will be his father.

source: ཡུམ་ནི་ཤིན་ཏུ་ཞི་བའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of Utter Peace will be his mother.

source: སྲས་ནི་ཕལ་ཆེན་དགའ་ཞེས་བྱའོ། །
en: Vast Joy will be his son.

source: རིམ་གྲོ་པ་ནི་གང་པོ་ཞེས་བྱའོ། །
en: Complete will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཚུགས་མེད་ཅེས་བྱའོ། །
en: Indomitable will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཁྲུལ་མེད་ཅེས་བྱའོ། །
en: Free from Delusion will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅྭ་ལྔ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་གསུམ་དང་བྱེ་བ་ཕྲག་དྲུག་དྲུག་གོ། །
en: There will be fifteen consecutive congregations, each of them gathering three hundred sixty million.

source: དེ་བཞིན་གཤེགས་པ་རབ་གསལ་རྒྱལ་པོ་སྐྱེ་བའི་ཡུལ་ནི་ཏོག་གི་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Pradyotarāja will be born in a place called Radiant Crest.

source: རིམ་གྲོ་པ་ནི་ལེགས་མཐོང་ཞེས་བྱའོ། །
en: Excellent Sight will be his attendant.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྣམ་པར་རོལ་པ་ཅན་ཞེས་བྱའོ། །
en: Reveling will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་དགུ་དང་འབུམ་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be twenty-four consecutive congregations, each of them gathering nine million eight hundred thousand.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་བྱེ་བ་ཕྲག་གཉིས་ཀྱི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for twenty million years.

source: དེ་བཞིན་གཤེགས་པ་ཁ་ལོ་སྒྱུར་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་གསལ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Sārathi will be born in a place called Radiant Splendor.

source: ཡུམ་ནི་མི་འཇིགས་བྱིན་ཞེས་བྱའོ། །
en: Fearlessness Gift will be his mother.

source: སྲས་ནི་མཐོང་དགའ་ཞེས་བྱའོ། །
en: Joyous Sight will be his son.

source: རིམ་གྲོ་པ་ནི་སྒྲོན་མའི་ལག་ཅེས་བྱའོ། །
en: Lamp Hand will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་མི་འཁྲུག་ཅེས་བྱའོ། །
en: Unperturbed Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ངེས་བརྟན་ཞེས་བྱའོ། །
en: Certain Firmness will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བརྒྱད་དང་བྱེ་བ་ཕྲག་ལྔ་ལྔའོ། །
en: There will be seventy consecutive congregations, each of them gathering eight hundred fifty million.

source: དེ་བཞིན་གཤེགས་པ་དགའ་བའི་དབང་ཕྱུག་སྐྱེ་བའི་ཡུལ་ནི་ཡིད་དུ་འོང་བའི་དབྱངས་ཅན་ཞེས་བྱའོ། །
en: “The thus-gone Nandeśvara will be born in a place called Endowed with Delightful Melody.

source: འོད་ནི་དཔག་ཚད་བདུན་ཁྲིའོ། །
en: His light will extend seventy thousand leagues.

source: ཡབ་ནི་དགའ་བའི་དབྱངས་ཞེས་བྱའོ། །
en: Joyous Melody will be his father.

source: ཡུམ་ནི་སྒྲོན་མ་བྱིན་ཞེས་བྱའོ། །
en: Lamp Gift will be his mother.

source: སྲས་ནི་སྟོབས་བྱིན་ཞེས་བྱའོ། །
en: Strength Gift will be his son.

source: རིམ་གྲོ་པ་ནི་ཡིད་དུ་འོང་བའི་དབྱངས་ཞེས་བྱའོ། །
en: Delightful Melody will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདེན་པའི་བློ་ཞེས་བྱའོ། །
en: Mind of Truth will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Infinite Qualities will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགྲ་བཅོམ་པ་ཐེར་འབུམ་ཕྲག་དྲུག་ཅུའོ། །
en: In the first congregation will gather sixty billion worthy ones;
